zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/ПланыВыручкиПоАптекам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПланыВыручкиПоАптекам</name>
  <registerRecords>InformationRegister.ПланыВыручкиПоАптекам</registerRecords>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Показатели</name>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеВсего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПланПоВыручкеОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КабинетВрача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КТЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗБезОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗМЗОптики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

zupcorp23012025.Расширение1/src/Documents/ПланыВыручкиПоАптекам/Forms/ФормаЗагрузкиИзExcel/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	Значение = Новый Структура();
	Значение.Вставить("Подразделение", ИндексКолонкиПоИмени(Подразделение));
	Значение.Вставить("ПланПоВыручкеВсего", ИндексКолонкиПоИмени(ПланПоВыручкеВсего));
	Значение.Вставить("ПланПоВыручкеОптики", ИндексКолонкиПоИмени(ПланПоВыручкеОптики));
	Значение.Вставить("КабинетВрача", ИндексКолонкиПоИмени(КабинетВрача));
	Значение.Вставить("КТЗБезОптики", ИндексКолонкиПоИмени(КТЗБезОптики));
	Значение.Вставить("ЗМЗБезОптики", ИндексКолонкиПоИмени(ЗМЗБезОптики));
	Значение.Вставить("ЗМЗОптики", ИндексКолонкиПоИмени(ЗМЗОптики));
	Значение.Вставить("НомерСтрокиНачало", НомерСтрокиНачало);
	Значение.Вставить("НомерСтрокиКонец", НомерСтрокиКонец);
	ЭтаФорма.Закрыть(Значение);
КонецПроцедуры
 &НаКлиенте
Процедура ПриОткрытии(Отказ)
	Подразделение="A";
	ПланПоВыручкеВсего="D";
	ПланПоВыручкеОптики="E";
	КабинетВрача="F";
	КТЗБезОптики="G";
	ЗМЗБезОптики="H";
	ЗМЗОптики="I";
	НомерСтрокиНачало=2;
	НомерСтрокиКонец=3;
КонецПроцедуры 
Функция ИндексКолонкиПоИмени(ИмяКолонки)
	КолСимволовВАлфавите = 26;
	Смещение             = КодСимвола("A", 1);
	КодСим               = КодСимвола(ИмяКолонки, 1);
	ПозСим               = КодСим - Смещение;
	
	Если СтрДлина(ИмяКолонки)=1 Тогда
		Возврат ПозСим;
	КонецЕсли;	
	
	Уровень              = ПозСим + 1;
	КодСим               = КодСимвола(ИмяКолонки, 2);
	ПозСим               = КодСим - Смещение;
	
	Возврат ПозСим + Уровень*КолСимволовВАлфавите;
КонецФункции
